my_dict = {'Саша': 2000, 'Илья': 1999, 'Полина': 1998, 'Вероника': 1999}
print('Ваш словарь:', my_dict)
print('Год рождения Саши:', my_dict['Саша'])
print('Год рождения Нади:', my_dict.get('Надя', 'такого ключа нет в словаре'))
my_dict.update({'Надя': 1958, 'Шелдон': 2024})
my_dict.pop('Саша')
print('Актуальный словарь:', my_dict)

my_set = {1, 1, 1, 2, 2, 3, 4, 2, 'слово 1', 'слово 2', 'слово 1', 'слово 2'}
print('Множество:', my_set)
my_set.add('слово 3')
my_set.add(False)
my_set.discard('слово 1')
print('Изменённое множество:', my_set)